# Pandas 基本功能学习

pandas 是一种列存数据分析 API。它是用于处理和分析输入数据的强大工具，很多机器学习框架都支持将 pandas 数据结构作为输入。
这里初步探索最常用的相关功能。

主要是以下三块内容：
*  验证相关类库是否正常安装
*  重要数据结构DataFrame和Series学习了解
*  与csv文件的数据交互

## 1.环境验证

引用pandas,并查看其版本，确定 Pandas 已经正确安装。

In [1]:
import pandas as pd
pd.__version__

'0.20.3'

如果正常显示该类库版本号，则表明安装成功
若安装失败，可以查看[Anaconda 安装说明](http://www.baidu.com)相关内容

## 2.DataFrame 和 Series
介绍DataFrame和Series基本数据结构和应用场景

DataFrame可以理解为数据表格，其中包含多个数据字段列。
Series，就是DateFrame的数据列，每个 Series 都有自己的名称。

### 创建
可以通过Series构造方法创建Series对象。

In [2]:
ids = pd.Series([1,2,3,4,5])
ids

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
names = pd.Series(["a","b","c","d","e"])
names2 = pd.Series(["A","B"])

DataFrame 的应用也是类似的，这里可以将相关series数据加载进来

In [4]:
df1 = pd.DataFrame({'id':ids,'name':names})
df1

   id name
0   1    a
1   2    b
2   3    c
3   4    d
4   5    e

In [5]:
df2= pd.DataFrame({'id':ids,'name':names2})
df2

   id name
0   1    A
1   2    B
2   3  NaN
3   4  NaN
4   5  NaN

这里需要注意：当数据量不匹配时，会根据数据类型创建空值NaN

### 数据访问
可以通过类名及索引号进行数据的访问，注意这里的索引是从0开始的

In [6]:
df1['name'][1]

'b'

In [7]:
df1[0:3]

   id name
0   1    a
1   2    b
2   3    c

### 修改数据 
直接通过赋值的方法就能够修改相关数据

In [8]:
df1['name'] = pd.Series(["AA1","AA2","AA3"])
df1

   id name
0   1  AA1
1   2  AA2
2   3  AA3
3   4  NaN
4   5  NaN

## 3.从CSV文件中读取

In [9]:
california_housing_dataframe = pd.read_csv("https://storage.googleapis.com/mledu-datasets/california_housing_train.csv", sep=",")
california_housing_dataframe.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,2643.664412,539.410824,1429.573941,501.221941,3.883578,207300.912353
std,2.005166,2.137340,12.586937,2179.947071,421.499452,1147.852959,384.520841,1.908157,115983.764387
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.790000,33.930000,18.000000,1462.000000,297.000000,790.000000,282.000000,2.566375,119400.000000
50%,-118.490000,34.250000,29.000000,2127.000000,434.000000,1167.000000,409.000000,3.544600,180400.000000
75%,-118.000000,37.720000,37.000000,3151.250000,648.250000,1721.000000,605.250000,4.767000,265000.000000
max,-114.310000,41.950000,52.000000,37937.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

## 总结：本次内容主要介绍了Pandas中最常用的数据类型，这里可以简单理解为Table，这是很多机器学习框架都支持的数据类型，所以很有必要做相关了解。